<!-- dflook/terraform-github-actions {"workspace":"default","backend":"012909d5d3f1a1f46d9f2f65c7275fdffc09ef6a1d49b3c11db62d814276f974","backend_type":"gcs"} -->
Terraform plan in __./terraform/dev__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_actions_workload_identity_federation_for_repository.google_service_account_iam_member.member will be created
  + resource "google_service_account_iam_member" "member" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principalSet://iam.googleapis.com/projects/117726861049/locations/global/workloadIdentityPools/github-actions/attribute.repository/dojo-engineering-dev/tmsapp4"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.github_actions_workload_identity_federation_for_repository.module.service-accounts-terraform-github-actions.google_project_iam_member.project-roles["tmsapp4-dojo-platform-dev-2022=>roles/"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dojo-platform-dev-2022"
      + role    = "roles/"
    }

  # module.github_actions_workload_identity_federation_for_repository.module.service-accounts-terraform-github-actions.google_project_iam_member.project-roles["tmsapp4-dojo-platform-dev-2022=>roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "dojo-platform-dev-2022"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.github_actions_workload_identity_federation_for_repository.module.service-accounts-terraform-github-actions.google_service_account.service_accounts["tmsapp4"] will be created
  + resource "google_service_account" "service_accounts" {
      + account_id   = "*******"
      + disabled     = false
      + display_name = "tmsapp4"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "dojo-platform-dev-2022"
      + unique_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan dev #3](https://github.com/dojo-engineering-dev/tms-test-iac-dev/actions/runs/2664161801)